Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/reference.tmx
Source language: en
Languages: pt

source: Compound statements
pt: Comandos compostos

source: Compound statements contain (groups of) other statements; they affect or control the execution of those other statements in some way. In general, compound statements span multiple lines, although in simple incarnations a whole compound statement may be contained in one line.
pt: Comandos compostos contêm (grupos de) outros comandos; eles afetam ou controlam a execução daqueles outros comandos de alguma forma. Em geral, comandos compostos se espalham por múltiplas linhas, apesar de que em simples encarnações um comando composto completo pode estar contido em uma linha.

source: if test1: if test2: print(x)
pt: if teste1: if teste2: print(x)

source: Summarizing:
pt: Resumindo:

source: The formatting of the grammar rules in the following sections places each clause on a separate line for clarity.
pt: A formatação das regras gramaticais nas seguintes seções coloca cada cláusula em uma linha separada por uma questão de clareza.

source: The :keyword:`for` statement
pt: O comando :keyword:`for`

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information on using the :keyword:`raise` statement to generate exceptions may be found in section :ref:`raise`.
pt: Informação adicional sobre exceções pode ser encontrada na seção ref:`exceções`, e informação sobre o uso do comando :keyword:`raise` para gerar exceções pode ser encontrada na seção :ref:`raise`.

source: The :keyword:`with` statement
pt: O comando :keyword:`with`

source: The execution of the :keyword:`with` statement with one "item" proceeds as follows:
pt: A execução do comando :keyword:`with` com um "item" procede como se segue:

source: The context expression is evaluated to obtain a context manager.
pt: A expressão contextual é avaliada para obter um gerenciador de contexto.

source: is equivalent to ::
pt: é equivalente a ::

source: See also
pt: Veja também

source: Function definitions
pt: Definições de funções

source: It is also possible to create anonymous functions (functions not bound to a name), for immediate use in expressions. This uses lambda forms, described in section :ref:`lambda`. Note that the lambda form is merely a shorthand for a simplified function definition; a function defined in a ":keyword:`def`" statement can be passed around or assigned to another name just like a function defined by a lambda form. The ":keyword:`def`" form is actually more powerful since it allows the execution of multiple statements and annotations.
pt: É possível também criar funções anônimas (funções não ligadas a um nome), para uso imediato em expressões. Isso faz uso de formas lambda, descritas na seção :ref:`lambda`. Observe que a forma lambda é meramente um "atalho" para definição de função simplificada; uma função definida em um comando ":keyword:`def`" pode ser passada ou atribuída a outro nome da mesma forma que uma função definida por uma forma lambda o pode. A forma ":keyword:`def`" é na verdade mais poderosa, uma vez que permite a execução de múltiplos comandos e anotações.

source: Class definitions
pt: Definições de classes

source: Footnotes
pt: Notas de rodapé

source: Data model
pt: Modelo de dados

source: Objects, values and types
pt: Objetos, valores e tipos

source: Objects are never explicitly destroyed; however, when they become unreachable they may be garbage-collected. An implementation is allowed to postpone garbage collection or omit it altogether --- it is a matter of implementation quality how garbage collection is implemented, as long as no objects are collected that are still reachable.
pt: Objetos nunca são explicitamente destruídos; no entanto, quando eles se tornam "inalcançáveis", eles podem ser coletados pela operação de garbage collection. Uma implementação tem a permissão de adiar a garbage collection ou de a omitir completamente --- é uma questão de qualidade de implementação a forma com que a garbage collection é implementada, contanto que nenhum objeto que ainda é alcançável seja coletado.

source: The standard type hierarchy
pt: A hierarquia de tipos padrão

source: Below is a list of the types that are built into Python. Extension modules (written in C, Java, or other languages, depending on the implementation) can define additional types. Future versions of Python may add types to the type hierarchy (e.g., rational numbers, efficiently stored arrays of integers, etc.), although such additions will often be provided via the standard library instead.
pt: Abaixo segue uma lista dos tipos que vêm com Python. Módulos de extensão (escritos em C, Java, ou outras linguagens, dependendo da implementação) podem definir tipos adicionais. Futuras versões de Python podem adicionar tipos à hierarquia de tipos (por exemplo, números racionais, arrays de inteiros eficientemente armazenados, etc.), apesar de que tais adições serão frequentemente fornecidas pela standard library (o que pode ser traduzido como "biblioteca padrão") ao invés disso.

source: Some of the type descriptions below contain a paragraph listing 'special attributes.' These are attributes that provide access to the implementation and are not intended for general use. Their definition may change in the future.
pt: Algumas das descrições de tipos abaixo contêm um parágrafo listando 'atributos especiais.' Esses são atributos que fornecem acesso à implementação e não têm a intenção de serem usados de modo geral. Sua definição pode mudar no futuro.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``None``. It is used to signify the absence of a value in many situations, e.g., it is returned from functions that don't explicitly return anything. Its truth value is false.
pt: Esse tipo possui um único valor. Há um único objeto com esse valor. Esse objeto é acessado pelo nome já presente ``None``. Ele é usado para significar a ausência de um valor em muitas situações, por exemplo, ele é retornado por funções que não devolvem nenhum valor explicitamente. Seu valor de verdade é false (traduzido como falso).

source: Python distinguishes between integers, floating point numbers, and complex numbers:
pt: Python faz uma distinção entre inteiros, números de ponto flutuante, e números complexos:

source: These represent elements from the mathematical set of integers (positive and negative).
pt: Esses representam elementos do conjunto matemático de inteiros (positivos e negativos).

source: There are two types of integers:
pt: Existem dois tipos de inteiros:

source: Integers (:class:`int`)
pt: Inteiros (:classe:`int`)

source: The rules for integer representation are intended to give the most meaningful interpretation of shift and mask operations involving negative integers.
pt: As regras para representação de inteiros têm a intenção de dar a interpretação mais significativa das operações de shift e mask envolvendo inteiros negativos.

source: Sequences are distinguished according to their mutability:
pt: Sequências são distinguidas de acordo com sua mutabilidade:

source: The following types are immutable sequences:
pt: Os seguintes tipos são sequências imutáveis:

source: There are currently two intrinsic mutable sequence types:
pt: Existem atualmente dois tipos sequenciais mutáveis intrínsecos:

source: The items of a list are arbitrary Python objects. Lists are formed by placing a comma-separated list of expressions in square brackets. (Note that there are no special cases needed to form lists of length 0 or 1.)
pt: Os itens de uma lista são objetos Python arbitrários. Listas são formadas colocando-se uma lista de expressões separadas por vírgula entre colchetes quadrados. (Observe que não há casos especiais necessários para a formação de listas de comprimento 0 ou 1.)

source: There are currently two intrinsic set types:
pt: Existem atualmente dois tipos de conjunto intrínsecos:

source: There is currently a single intrinsic mapping type:
pt: Existe atualmente um único tipo de mapeamento intrínseco:

source: Special attributes:
pt: Atributos especiais:
